package com.emperium;

import com.ninja_squad.dbsetup.operation.Operation;

import static com.ninja_squad.dbsetup.Operations.*;

public class DbOperations {

    public static final Operation DELETE_ALL = deleteAllFrom("Measurement", "Day", "City");

    public static final Operation INSERT_REFERENCE_DATA =
            sequenceOf(
                    insertInto("City")
                            .columns("id", "city")
                            .values(773, "ΘΕΣΣΑΛΟΝΙΚΗ")
                            .build(),
                    insertInto("Day")
                            .columns("id", "day", "city_id")
                            .values(5117, "2021-01-26", 773)
                            .values(5118, "2021-01-27", 773)
                            .values(5119, "2021-01-28", 773)
                            .values(5120, "2021-01-29", 773)
                            .values(5121, "2021-01-30", 773)
                            .values(5122, "2021-01-31", 773)
                            .values(5123, "2021-02-01", 773)
                            .build(),
                    insertInto("Measurement")
                            .columns("id", "time", "temperature", "humidity", "wind", "phenomeno", "day_id")
                            .values(27770, "14:00:00", 13, 85, "4 Μπφ NA", "ΑΣΘΕΝΗΣ ΒΡΟΧΗ",  5117)
                            .values(27771, "17:00:00", 6, 86,  "5 Μπφ B",  "ΒΡΟΧΗ",          5117)
                            .values(27772, "20:00:00", 5, 87,  "4 Μπφ ΒΔ", "ΒΡΟΧΗ",          5117)
                            .values(27773, "23:00:00", 5, 63,  "5 Μπφ ΒΔ", "ΑΣΘΕΝΗΣ ΒΡΟΧΗ",  5117)
                            .values(27774, "02:00:00", 4, 65,  "5 Μπφ ΒΔ", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5118)
                            .values(27775, "05:00:00", 3, 68,  "5 Μπφ ΒΔ", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5118)
                            .values(27776, "08:00:00", 2, 69,  "5 Μπφ ΒΔ", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5118)
                            .values(27777, "11:00:00", 5, 55,  "5 Μπφ ΒΔ", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5118)
                            .values(27778, "14:00:00", 6, 46,  "5 Μπφ ΒΔ", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5118)
                            .values(27779, "17:00:00", 5, 50,  "4 Μπφ ΒΔ", "ΛΙΓΑ ΣΥΝΝΕΦΑ",   5118)
                            .values(27780, "20:00:00", 4, 64,  "3 Μπφ ΒΔ", "ΚΑΘΑΡΟΣ",        5118)
                            .values(27781, "23:00:00", 3, 72,  "3 Μπφ ΒΔ", "ΚΑΘΑΡΟΣ",        5118)
                            .values(27782, "02:00:00", 2, 73,  "3 Μπφ ΒΔ", "ΛΙΓΑ ΣΥΝΝΕΦΑ",   5119)
                            .values(27783, "05:00:00", 1, 72,  "2 Μπφ ΒΔ", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5119)
                            .values(27784, "08:00:00", 1, 68,  "2 Μπφ B",  "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5119)
                            .values(27785, "11:00:00", 4, 53,  "4 Μπφ ΒΔ", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5119)
                            .values(27786, "14:00:00", 6, 38,  "4 Μπφ ΒΔ", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5119)
                            .values(27787, "17:00:00", 5, 48,  "2 Μπφ ΒΔ", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5119)
                            .values(27788, "20:00:00", 4, 58,  "2 Μπφ B",  "ΚΑΘΑΡΟΣ",        5119)
                            .values(27789, "23:00:00", 3, 64,  "2 Μπφ B",  "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5119)
                            .values(27790, "02:00:00", 2, 75,  "1 Μπφ BA", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5120)
                            .values(27791, "05:00:00", 2, 86,  "1 Μπφ Α",  "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5120)
                            .values(27792, "08:00:00", 2, 76,  "1 Μπφ BA", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5120)
                            .values(27793, "11:00:00", 7, 55,  "1 Μπφ BA", "ΛΙΓΑ ΣΥΝΝΕΦΑ",   5120)
                            .values(27794, "14:00:00", 9, 55,  "1 Μπφ N",  "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5120)
                            .values(27795, "17:00:00", 9, 69,  "1 Μπφ NA", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5120)
                            .values(27796, "20:00:00", 6, 86,  "1 Μπφ BA", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5120)
                            .values(27797, "23:00:00", 6, 91,  "1 Μπφ NA", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5120)
                            .values(27798, "02:00:00", 7, 88,  "2 Μπφ Α",  "ΑΣΘΕΝΗΣ ΒΡΟΧΗ",  5121)
                            .values(27799, "05:00:00", 7, 93,  "2 Μπφ BA", "ΒΡΟΧΗ",          5121)
                            .values(27800, "08:00:00", 6, 99,  "1 Μπφ B",  "ΑΣΘΕΝΗΣ ΒΡΟΧΗ",  5121)
                            .values(27801, "11:00:00", 10, 73, "4 Μπφ ΒΔ", "ΚΑΘΑΡΟΣ",        5121)
                            .values(27802, "14:00:00", 14, 59, "4 Μπφ ΒΔ", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5121)
                            .values(27803, "17:00:00", 12, 70, "2 Μπφ B",  "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5121)
                            .values(27804, "20:00:00", 10, 82, "2 Μπφ Α",  "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5121)
                            .values(27805, "23:00:00",  9, 86, "2 Μπφ NA", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5121)
                            .values(27806, "02:00:00",  8, 82, "2 Μπφ NA", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5122)
                            .values(27807, "05:00:00",  9, 78, "2 Μπφ Α",  "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ", 5122)
                            .values(27808, "08:00:00",  8, 88, "2 Μπφ Α", "ΑΣΘΕΝΗΣ ΒΡΟΧΗ",   5122)
                            .values(27809, "11:00:00", 11, 84, "2 Μπφ Α", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ",  5122)
                            .values(27810, "14:00:00", 13, 85, "2 Μπφ Α", "ΑΣΘΕΝΗΣ ΒΡΟΧΗ",   5122)
                            .values(27811, "17:00:00", 11, 93, "2 Μπφ BA","ΒΡΟΧΗ",           5122)
                            .values(27812, "20:00:00", 9,  98, "1 Μπφ B", "ΑΡΚΕΤΑ ΣΥΝΝΕΦΑ",  5122)
                            .values(27813, "23:00:00", 8,  99, "1 Μπφ B", "ΠΕΡΙΟΡΙΣΜΕΝΗ ΟΡΑΤΟΤΗΤΑ", 5122)
                            .values(27814, "02:00:00", 8,  89, "3 Μπφ B", "ΑΡΑΙΗ ΣΥΝΝΕΦΙΑ", 5123)
                            .build()
                    );
}
